integration/src/InformationRegisters/грОчередьДозапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>грОчередьДозапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетчикОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>idflow</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

integration/src/InformationRegisters/грОчередьДозапросов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Записывает ключи в очередь дозапросов, используется для многопоточной обработки
//
// Параметры:
//  Ключи - Массив - ключи ТПК;
//  idflow - Строка - идентификатор потока;
//  Информация - Структура - Информация по дозапросу:
//     * ДатаОтправки - Дата - дата отправки дозапроса
//     * Описание - Строка - описание дозапроса
//     * Ошибка - Ошибка - описание ошибки дозапроса
//  ДополнительныеПараметры - Структура - дополнительные параметры отправки:
//     * ОтправлятьДозапрос - Истина - признак отправки дозапроса в esb
// 
Процедура ЗаписатьКлючиВОчередьДозапросов( Ключи, idflow, Информация = Неопределено, ДополнительныеПараметры = Неопределено  ) Экспорт 
	
	МассивКлючей = СтрРазделить( Ключи, Символы.ПС );
	Для каждого Ключ Из МассивКлючей Цикл
		
		Если Не ЗначениеЗаполнено( Ключ ) Тогда
			Продолжить;
		КонецЕсли;
		
		РегистрыСведений.грОчередьДозапросов.ЗаписатьВОчередьДозапросов( Ключ, idflow, Информация, ДополнительныеПараметры );
		
	КонецЦикла;
	
КонецПроцедуры

// Отправляет дозапросы в ESB
//
// Параметры:
//  Ключ - Строка - ключ объекта;
//  idflow - Строка - идентификатор потока;
//  Информация - Структура - Информация по дозапросу:
//     * ДатаОтправки - Дата - дата отправки дозапроса
//     * Описание - Строка - описание дозапроса
//     * Ошибка - Ошибка - описание ошибки дозапроса
//  ДополнительныеПараметры - Структура - дополнительные параметры отправки:
//     * ОтправлятьДозапрос - Истина - признак отправки дозапроса в esb
// 
Процедура ЗаписатьВОчередьДозапросов( Ключ, idflow, Информация = Неопределено, ДополнительныеПараметры = Неопределено ) Экспорт 
	
	МЗ = РегистрыСведений.грОчередьДозапросов.СоздатьМенеджерЗаписи();
	МЗ.Ключ = Ключ;
	МЗ.idflow = idflow;
	
	Если Не Информация = Неопределено Тогда
		Информация.Свойство( "ДатаОтправки", МЗ.ДатаОтправки);
		Информация.Свойство( "Описание", МЗ.Описание);
		Информация.Свойство( "Ошибка", МЗ.Ошибка);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено( МЗ.ДатаОтправки ) Тогда
		МЗ.ДатаОтправки = ТекущаяДатаСеанса();
	КонецЕсли;
	
	МЗ.Записать();
	
	Если ДополнительныеПараметры.ОтправлятьДозапрос Тогда
		
		ПараметрыДозапроса = Новый Структура( "idflow,Ключ", idflow, Ключ );
		сшпПользовательскиеМетоды.ПоместитьВОчередьИсходящих( "Дозапрос" , ПараметрыДозапроса );
		
	КонецЕсли;

КонецПроцедуры

// Устарела. Следует использовать новую см. ОбщегоНазначения.ЗаписатьВОчередьДозапросов
//
// Отправляет дозапросы в ESB
//  idflow - Строка - идентификатор потока;
//  Ключ - Строка - ключ объекта;
// 
Процедура ОтправитьДозапрос( idflow, Ключ, УдалитьЗапись = Ложь ) Экспорт 
	
	ПараметрыДозапроса = Новый Структура( "idflow,Ключ", idflow, Ключ );
	сшпПользовательскиеМетоды.ПоместитьВОчередьИсходящих( "Дозапрос" , ПараметрыДозапроса );
	
	МЗ = РегистрыСведений.грОчередьДозапросов.СоздатьМенеджерЗаписи();
	МЗ.Ключ = Ключ;
	МЗ.idflow = idflow;
	
	Если УдалитьЗапись Тогда
		МЗ.Удалить();
	Иначе
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			
			МЗ.ДатаОтправки = ТекущаяДатаСеанса();
			
			//+++ GRADUM, Теплоухов А.В. 2021_05_19 Задача № 21539{
			МЗ.СчетчикОтправки = МЗ.СчетчикОтправки + 1;
			//--- GRADUM, Теплоухов А.В. 2021_05_19 Задача № 21539}
			
			МЗ.Записать();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
